// 2. Напишіть програму, яка оголошує константний вказівник на постійне
//    ціле значення. Ініціалізуйте цей вказівник, щоб він вказав на цілісну
//    змінну varOne. Надайте змінній varOne значення 6. Використовуйте
//    вказівник, щоб, присвоїти змінній varOne значення 7. Створіть другу
//    цілочисленну змінну varTwo. Перепризначте вказівник, щоб він
//    вказував на змінну varTwo. Поки не компілюйте цю вправу.

// 3. Скомпілюйте програму, написану у вправі 2. Які дії компілятор
//    вважає помилковими? Які рядки генерують попередження?

// Ответ: константный указатель не может изменить адрес который в нем хранится

#include <iostream>

int main()
{
    int varOne = 0;
    int *const pvarOne = &varOne;
    varOne = 6;
    std::cout << varOne << "\n";
    *pvarOne = 7;
    std::cout << varOne << "\n";
    int varTwo = 8;
    pvarOne = &varTwo;

    return 0;
}